Revit 2024 API
MeshFromGeometryOperationResult Class
 Describes what TessellatedShapeBuilder has built.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class MeshFromGeometryOperationResult : IDisposable
Visual Basic
Public Class MeshFromGeometryOperationResult _
	Implements IDisposable
Visual C++
public ref class MeshFromGeometryOperationResult : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.MeshFromGeometryOperationResult
See Also
MeshFromGeometryOperationResult Members
Autodesk.Revit.DB Namespace